package homework018;

/*
 * FileName: Task03
 * Author:   Andriy Vulook
 * Date:     09.03.2023 0:33
 * Description: Go to the Oracle website.
 */

public class Task03 {

/*
    Тип enum — це спеціальний тип даних, який дозволяє змінній бути набором попередньо визначених констант.
    Змінна має дорівнювати одному із попередньо визначених для неї значень.
    Типовими прикладами є напрямки за компасом (значення ПІВНІЧ, ПІВДЕНЬ, СХІД і ЗАХІД) і дні тижня.
    Оскільки вони є константами, назви полів типу enum пишуться великими літерами.
    Ви повинні використовувати типи enum щоразу, коли вам потрібно представити фіксований набір констант.
    Це включає природні типи переліків, такі як планети в нашій сонячній системі та набори даних,
    де ви знаєте всі можливі значення під час компіляції, наприклад, вибір у меню, прапорці командного рядка тощо.
    Типи enum мови програмування Java набагато потужніші, ніж їхні аналоги в інших мовах.
    Оголошення enum визначає клас (так званий тип enum ). Тіло класу enum може містити методи та інші поля.
    Компілятор автоматично додає деякі спеціальні методи, коли створює перелік.
    Наприклад, у них є статичний value   sметод, який повертає масив, що містить усі значення переліку в тому порядку,
    в якому вони оголошені. Цей метод зазвичай використовується в поєднанні з конструкцією for-each
    для повторення значень типу enum.

    Примітка:  усі переліки неявно розширюють java.lang.Enum.
    Оскільки клас може розширювати лише одного батька, мова Java не підтримує багаторазове успадкування стану,
    і тому enum не може розширювати нічого іншого.

    Конструктор для типу enum має мати приватний доступ до пакета або приватний доступ.
    Він автоматично створює константи, визначені на початку тіла переліку.
    Ви не можете самостійно викликати конструктор enum.

*/

}
